In [55]:
import psycopg2 as pg2
import pandas as pd
import re
conn = pg2.connect(database='dvd_rentals', user='victor', password='}H9D^E*PUHTTuB&"')
cur = conn.cursor()

In [56]:
cur.execute("SELECT * FROM film")
filmdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film' ORDER BY ORDINAL_POSITION")
filmcolumns = list()
for i in cur.fetchall():
    filmcolumns.append(i[0])
filmdf = pd.DataFrame(data=filmdata, columns=filmcolumns)
filmdf = filmdf.drop(columns='last_update')
filmdf
#df from film table

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,[Behind the Scenes],'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,[Trailers],'airport':1 'ancient':18 'confront':14 'epic':...
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,[Trailers],'boat':20 'bright':1 'conquer':14 'encount':2 ...
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"[Deleted Scenes, Behind the Scenes]",'academi':1 'battl':15 'canadian':20 'dinosaur...
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Young Language,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"[Trailers, Behind the Scenes]",'administr':12 'boat':8 'boy':17 'databas':11 ...
996,997,Youth Kick,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"[Trailers, Behind the Scenes]",'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997,998,Zhivago Core,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,[Deleted Scenes],'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998,999,Zoolander Fiction,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"[Trailers, Deleted Scenes]",'ancient':19 'boat':11 'china':20 'discov':14 ...
999,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"[Trailers, Commentaries, Behind the Scenes]","'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona..."

In [57]:
cur.execute("SELECT * FROM actor")
actordata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'actor' ORDER BY ORDINAL_POSITION")
actorcolumns = list()
for i in cur.fetchall():
    actorcolumns.append(i[0])
actordf = pd.DataFrame(data=actordata, columns=actorcolumns)
actordf.drop(columns='last_update')
#df from actor table

     actor_id first_name     last_name
0           1   Penelope       Guiness
1           2       Nick      Wahlberg
2           3         Ed         Chase
3           4   Jennifer         Davis
4           5     Johnny  Lollobrigida
..        ...        ...           ...
195       196       Bela        Walken
196       197      Reese          West
197       198       Mary        Keitel
198       199      Julia       Fawcett
199       200      Thora        Temple

[200 rows x 3 columns]

In [58]:
cur.execute("SELECT * FROM film_actor")
film_actordata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_actor' ORDER BY ORDINAL_POSITION")
film_actorcolumns = list()
for i in cur.fetchall():
    film_actorcolumns.append(i[0])
film_actordf = pd.DataFrame(data=film_actordata, columns=film_actorcolumns)
film_actordf.drop(columns='last_update')
#df from film_actor table

      actor_id  film_id
0            1        1
1            1       23
2            1       25
3            1      106
4            1      140
...        ...      ...
5457       200      879
5458       200      912
5459       200      945
5460       200      958
5461       200      993

[5462 rows x 2 columns]

In [59]:
cur.execute("SELECT * FROM rental")
rentaldata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'rental' ORDER BY ORDINAL_POSITION")
rentalcolumns = list()
for i in cur.fetchall():
    rentalcolumns.append(i[0])
rentaldf = pd.DataFrame(data=rentaldata, columns=rentalcolumns)
rentaldf.drop(columns='last_update')
#df from rental table

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
1,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
2,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
3,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1
4,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1
...,...,...,...,...,...,...
16039,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2
16040,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2
16041,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1
16042,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2
16043,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1

In [60]:
cur.execute("SELECT * FROM payment")
paymentdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'payment' ORDER BY ORDINAL_POSITION")
paymentcolumns = list()
for i in cur.fetchall():
    paymentcolumns.append(i[0])
paymentdf = pd.DataFrame(data=paymentdata, columns=paymentcolumns)
paymentdf.drop(columns='payment_date')
#df from payment table

       payment_id  customer_id  staff_id  rental_id amount
0           17503          341         2       1520   7.99
1           17504          341         1       1778   1.99
2           17505          341         1       1849   7.99
3           17506          341         2       2829   2.99
4           17507          341         2       3130   7.99
...           ...          ...       ...        ...    ...
14591       32094          245         2      12682   2.99
14592       32095          251         1      14107   0.99
14593       32096          252         2      13756   4.99
14594       32097          263         1      15293   0.99
14595       32098          264         2      14243   2.99

[14596 rows x 5 columns]

In [61]:
cur.execute("SELECT * FROM inventory")
inventorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'inventory' ORDER BY ORDINAL_POSITION")
inventorycolumns = list()
for i in cur.fetchall():
    inventorycolumns.append(i[0])
inventorydf = pd.DataFrame(data=inventorydata, columns=inventorycolumns)
inventorydf.drop(columns='last_update')
#df from inventory table

      inventory_id  film_id  store_id
0                1        1         1
1                2        1         1
2                3        1         1
3                4        1         1
4                5        1         2
...            ...      ...       ...
4576          4577     1000         1
4577          4578     1000         2
4578          4579     1000         2
4579          4580     1000         2
4580          4581     1000         2

[4581 rows x 3 columns]

In [62]:
cur.execute("SELECT * FROM film_category")
film_categorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_category' ORDER BY ORDINAL_POSITION")
film_categorycolumns = list()
for i in cur.fetchall():
    film_categorycolumns.append(i[0])
film_categorydf = pd.DataFrame(data=film_categorydata, columns=film_categorycolumns)
film_categorydf.drop(columns='last_update')
#df from film_category table

     film_id  category_id
0          1            6
1          2           11
2          3            6
3          4           11
4          5            8
..       ...          ...
995      996            6
996      997           12
997      998           11
998      999            3
999     1000            5

[1000 rows x 2 columns]

In [63]:
cur.execute("SELECT * FROM category")
categorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'category' ORDER BY ORDINAL_POSITION")
categorycolumns = list()
for i in cur.fetchall():
    categorycolumns.append(i[0])
categorydf = pd.DataFrame(data=categorydata, columns=categorycolumns)
categorydf.drop(columns='last_update')
#df from category table

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

In [64]:
cur.execute("SELECT * FROM staff")
staffdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'staff' ORDER BY ORDINAL_POSITION")
staffcolumns = list()
for i in cur.fetchall():
    staffcolumns.append(i[0])
staffdf = pd.DataFrame(data=staffdata, columns=staffcolumns)
staffdf.drop(columns='last_update')
#df from staff table

,staff_id,first_name,last_name,address_id,email,store_id,active,username,password,picture
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'..."
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None

In [65]:
cur.execute("SELECT * FROM store")
storedata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'store' ORDER BY ORDINAL_POSITION")
storecolumns = list()
for i in cur.fetchall():
    storecolumns.append(i[0])
storedf = pd.DataFrame(data=storedata, columns=storecolumns)
storedf.drop(columns='last_update')
#df from store table

   store_id  manager_staff_id  address_id
0         1                 1           1
1         2                 2           2

In [66]:
#1 master
df1 = pd.merge(filmdf, film_actordf, how='left', on='film_id')
df2 = pd.merge(df1, actordf, how='left', on='actor_id')
df3 = pd.merge(df2, inventorydf, how='left', on='film_id')
df4 = pd.merge(df3, rentaldf, how='left', on='inventory_id')
m1 = pd.merge(df4, paymentdf, how='left', on='rental_id')
m1

/tmp/ipykernel_17626/2184309566.py:5: FutureWarning: Passing 'suffixes' which cause duplicate columns {'last_update_x'} in the result is deprecated and will raise a MergeError in a future version.
  df4 = pd.merge(df3, rentaldf, how='left', on='inventory_id')

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,rental_date,customer_id_x,return_date,staff_id_x,last_update_y,payment_id,customer_id_y,staff_id_y,amount,payment_date
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-07 17:52:38,91.0,2005-07-11 23:37:38,1.0,2006-02-16 02:30:53,30006.0,91.0,1.0,4.99,2007-04-07 16:21:04.996577
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-31 22:01:41,236.0,2005-08-07 22:24:41,1.0,2006-02-16 02:30:53,31589.0,236.0,2.0,4.99,2007-04-30 20:30:07.996577
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2006-02-14 15:16:03,60.0,NaT,2.0,2006-02-16 02:30:53,32034.0,60.0,2.0,0.00,2007-05-14 13:44:29.996577
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-30 23:26:05,481.0,2005-08-04 17:46:05,1.0,2006-02-16 02:30:53,27576.0,481.0,1.0,4.99,2007-04-30 21:54:31.996577
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-08-17 07:29:44,553.0,2005-08-19 02:06:44,2.0,2006-02-16 02:30:53,22214.0,553.0,2.0,4.99,2007-03-17 05:58:10.996577
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88265,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-05-29 03:49:03,215.0,2005-05-31 08:29:03,2.0,2006-02-16 02:30:53,NaN,NaN,NaN,NaN,NaT
88266,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-06-15 21:50:32,235.0,2005-06-17 01:02:32,2.0,2006-02-16 02:30:53,19381.0,235.0,1.0,4.99,2007-02-15 20:18:58.996577
88267,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-12 13:24:47,226.0,2005-07-20 09:35:47,2.0,2006-02-16 02:30:53,31454.0,226.0,1.0,9.99,2007-04-12 11:53:13.996577
88268,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-31 07:32:21,401.0,2005-08-01 05:07:21,2.0,2006-02-16 02:30:53,26689.0,401.0,2.0,4.99,2007-04-30 06:00:47.996577
88269,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-08-19 03:49:28,541.0,2005-08-25 01:51:28,2.0,2006-02-16 02:30:53,22110.0,541.0,1.0,7.99,2007-03-19 02:17:54.996577

In [71]:
#2 master
df11 = pd.merge(filmdf, film_categorydf, how='left', on='film_id')
df12 = pd.merge(df11, categorydf, how='left', on='category_id')
df13 = pd.merge(df12, inventorydf, how='left', on='film_id')
df14 = pd.merge(df13, rentaldf, how='left', on='inventory_id')
m2 = pd.merge(df14, paymentdf, how='left', on='rental_id')
m2

/tmp/ipykernel_17626/3349240972.py:5: FutureWarning: Passing 'suffixes' which cause duplicate columns {'last_update_x'} in the result is deprecated and will raise a MergeError in a future version.
  df14 = pd.merge(df13, rentaldf, how='left', on='inventory_id')

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,rental_date,customer_id_x,return_date,staff_id_x,last_update_y,payment_id,customer_id_y,staff_id_y,amount,payment_date
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-07 17:52:38,91.0,2005-07-11 23:37:38,1.0,2006-02-16 02:30:53,30006.0,91.0,1.0,4.99,2007-04-07 16:21:04.996577
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-31 22:01:41,236.0,2005-08-07 22:24:41,1.0,2006-02-16 02:30:53,31589.0,236.0,2.0,4.99,2007-04-30 20:30:07.996577
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2006-02-14 15:16:03,60.0,NaT,2.0,2006-02-16 02:30:53,32034.0,60.0,2.0,0.00,2007-05-14 13:44:29.996577
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-30 23:26:05,481.0,2005-08-04 17:46:05,1.0,2006-02-16 02:30:53,27576.0,481.0,1.0,4.99,2007-04-30 21:54:31.996577
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-08-17 07:29:44,553.0,2005-08-19 02:06:44,2.0,2006-02-16 02:30:53,22214.0,553.0,2.0,4.99,2007-03-17 05:58:10.996577
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16086,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-05-29 03:49:03,215.0,2005-05-31 08:29:03,2.0,2006-02-16 02:30:53,NaN,NaN,NaN,NaN,NaT
16087,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-06-15 21:50:32,235.0,2005-06-17 01:02:32,2.0,2006-02-16 02:30:53,19381.0,235.0,1.0,4.99,2007-02-15 20:18:58.996577
16088,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-12 13:24:47,226.0,2005-07-20 09:35:47,2.0,2006-02-16 02:30:53,31454.0,226.0,1.0,9.99,2007-04-12 11:53:13.996577
16089,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-31 07:32:21,401.0,2005-08-01 05:07:21,2.0,2006-02-16 02:30:53,26689.0,401.0,2.0,4.99,2007-04-30 06:00:47.996577
16090,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-08-19 03:49:28,541.0,2005-08-25 01:51:28,2.0,2006-02-16 02:30:53,22110.0,541.0,1.0,7.99,2007-03-19 02:17:54.996577

In [77]:
#3 & 4 master
df21 = pd.merge(filmdf, inventorydf, how='left', on='film_id')
df22 = pd.merge(df21, rentaldf, how='left', on='inventory_id')
df23 = pd.merge(df22, paymentdf, how='left', on='rental_id')
#df24 = pd.merge(df23, staffdf, how='left', on='staff_id')
#m3_4 = pd.merge(df24, storedf, how='left', on='store_id')
#m3_4
df23

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,rental_date,customer_id_x,return_date,staff_id_x,last_update_y,payment_id,customer_id_y,staff_id_y,amount,payment_date
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-07 17:52:38,91.0,2005-07-11 23:37:38,1.0,2006-02-16 02:30:53,30006.0,91.0,1.0,4.99,2007-04-07 16:21:04.996577
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-31 22:01:41,236.0,2005-08-07 22:24:41,1.0,2006-02-16 02:30:53,31589.0,236.0,2.0,4.99,2007-04-30 20:30:07.996577
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2006-02-14 15:16:03,60.0,NaT,2.0,2006-02-16 02:30:53,32034.0,60.0,2.0,0.00,2007-05-14 13:44:29.996577
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-07-30 23:26:05,481.0,2005-08-04 17:46:05,1.0,2006-02-16 02:30:53,27576.0,481.0,1.0,4.99,2007-04-30 21:54:31.996577
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,2005-08-17 07:29:44,553.0,2005-08-19 02:06:44,2.0,2006-02-16 02:30:53,22214.0,553.0,2.0,4.99,2007-03-17 05:58:10.996577
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16086,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-05-29 03:49:03,215.0,2005-05-31 08:29:03,2.0,2006-02-16 02:30:53,NaN,NaN,NaN,NaN,NaT
16087,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-06-15 21:50:32,235.0,2005-06-17 01:02:32,2.0,2006-02-16 02:30:53,19381.0,235.0,1.0,4.99,2007-02-15 20:18:58.996577
16088,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-12 13:24:47,226.0,2005-07-20 09:35:47,2.0,2006-02-16 02:30:53,31454.0,226.0,1.0,9.99,2007-04-12 11:53:13.996577
16089,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-07-31 07:32:21,401.0,2005-08-01 05:07:21,2.0,2006-02-16 02:30:53,26689.0,401.0,2.0,4.99,2007-04-30 06:00:47.996577
16090,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,2005-08-19 03:49:28,541.0,2005-08-25 01:51:28,2.0,2006-02-16 02:30:53,22110.0,541.0,1.0,7.99,2007-03-19 02:17:54.996577